drkpxl/esp32-cyd-aquarium/lib/Matrix/CYD/CydMatrix.cpp
#ifdef PANEL_CYD_TFT

#include "CydMatrix.h"

#include <esp_heap_caps.h>

#if defined(ESP_ARDUINO_VERSION) && ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
#define CYD_LEDC_V3 1
#else
#define CYD_LEDC_V3 0
#endif

#ifndef TFT_BACKLIGHT_ON
#define TFT_BACKLIGHT_ON HIGH
#endif

#ifndef CYD_TFT_ROTATION
#define CYD_TFT_ROTATION 0
#endif

#ifndef CYD_TFT_BACKLIGHT_PWM
#define CYD_TFT_BACKLIGHT_PWM 1
#endif

#ifndef CYD_TFT_BACKLIGHT_PWM_FREQ
#define CYD_TFT_BACKLIGHT_PWM_FREQ 5000
#endif

#ifndef CYD_TFT_BACKLIGHT_PWM_RESOLUTION
#define CYD_TFT_BACKLIGHT_PWM_RESOLUTION 8
#endif

#ifndef CYD_TFT_BACKLIGHT_PWM_CHANNEL
#define CYD_TFT_BACKLIGHT_PWM_CHANNEL 0
#endif

#ifndef CYD_TFT_SWAP_BYTES
#define CYD_TFT_SWAP_BYTES 1
#endif

// Some CYD panel revisions use BGR color order, which makes blue render as
// orange/red. Setting this swaps the red and blue channels at output.
#ifndef CYD_TFT_SWAP_RB
#define CYD_TFT_SWAP_RB 0
#endif

#ifndef CYD_TFT_TONE_CORRECTION
#define CYD_TFT_TONE_CORRECTION 1
#endif

#ifndef CYD_TFT_TONE_CURVE_STRENGTH
#define CYD_TFT_TONE_CURVE_STRENGTH 220
#endif

#ifndef CYD_TFT_TONE_BLACK_THRESHOLD
#define CYD_TFT_TONE_BLACK_THRESHOLD 4
#endif

#ifndef CYD_TFT_BACKGROUND_TONE_CURVE_STRENGTH
#define CYD_TFT_BACKGROUND_TONE_CURVE_STRENGTH CYD_TFT_TONE_CURVE_STRENGTH
#endif

#ifndef CYD_TFT_FOREGROUND_TONE_CURVE_STRENGTH
#define CYD_TFT_FOREGROUND_TONE_CURVE_STRENGTH 0
#endif

#ifndef CYD_TFT_FOREGROUND_GAIN
#define CYD_TFT_FOREGROUND_GAIN 170
#endif

#ifndef CYD_TFT_FOREGROUND_SATURATION
#define CYD_TFT_FOREGROUND_SATURATION 190
#endif

#ifndef CYD_BACKGROUND_BRIGHTNESS
#define CYD_BACKGROUND_BRIGHTNESS 44
#endif

#ifndef CYD_BACKGROUND_BLACK_THRESHOLD
#define CYD_BACKGROUND_BLACK_THRESHOLD 9
#endif

#ifndef CYD_FOREGROUND_BRIGHTNESS
#define CYD_FOREGROUND_BRIGHTNESS 235
#endif

#ifndef CYD_FOREGROUND_SATURATION
#define CYD_FOREGROUND_SATURATION 160
#endif

namespace {

constexpr uint8_t kColorProfileBackground = 1;
constexpr uint8_t kColorProfileForeground = 2;

constexpr uint8_t backlightOffLevel() {
  return TFT_BACKLIGHT_ON == HIGH ? LOW : HIGH;
}

constexpr uint32_t frameBufferPixelCount() {
  return static_cast<uint32_t>(CydMatrixSettings::VIEWPORT_WIDTH) *
         CydMatrixSettings::VIEWPORT_HEIGHT;
}

constexpr size_t frameBufferByteCount() {
  return frameBufferPixelCount() * sizeof(uint16_t);
}

constexpr uint16_t rowBufferLogicalHeight() {
  return 4;
}

constexpr uint16_t maxRowBufferHeight() {
  uint16_t maxHeight = 1;
  for (uint16_t y = 0; y < CydMatrixSettings::LOGICAL_HEIGHT;
       y += rowBufferLogicalHeight()) {
    const uint16_t y0 = CydMatrixSettings::screenYForLogicalEdge(y);
    const uint16_t nextYCandidate = y + rowBufferLogicalHeight();
    const uint16_t nextY =
        nextYCandidate < CydMatrixSettings::LOGICAL_HEIGHT
            ? nextYCandidate
            : CydMatrixSettings::LOGICAL_HEIGHT;
    const uint16_t y1 = CydMatrixSettings::screenYForLogicalEdge(nextY);
    const uint16_t height = y1 > y0 ? y1 - y0 : 1;
    maxHeight = height > maxHeight ? height : maxHeight;
  }
  return maxHeight;
}

constexpr size_t rowBufferByteCount() {
  return static_cast<size_t>(CydMatrixSettings::VIEWPORT_WIDTH) *
         maxRowBufferHeight() * sizeof(uint16_t);
}

constexpr float dotRadiusRatio() {
  return 0.43f;
}

uint8_t scaleChannelByBrightness(uint8_t value, uint8_t brightness) {
  return static_cast<uint8_t>(
      (static_cast<uint16_t>(value) * brightness + 127) / 255);
}

uint8_t applyTftToneCurve(uint8_t value, uint16_t strength,
                          uint8_t blackThreshold) {
#if CYD_TFT_TONE_CORRECTION
  if (value == 0 || value == 255) {
    return value;
  }

  strength = strength > 255 ? 255 : strength;
  const uint16_t linearWeight = 255 - strength;
  const uint16_t quadratic =
      (static_cast<uint16_t>(value) * value + 127) / 255;
  const uint16_t corrected =
      (static_cast<uint16_t>(value) * linearWeight + quadratic * strength +
       127) /
      255;

  if (blackThreshold > 0 && corrected < blackThreshold) {
    return 0;
  }
  return static_cast<uint8_t>(corrected > 255 ? 255 : corrected);
#else
  return value;
#endif
}

uint8_t maxChannel(uint8_t r, uint8_t g, uint8_t b) {
  return max(r, max(g, b));
}

uint8_t luma8(uint8_t r, uint8_t g, uint8_t b) {
  return static_cast<uint8_t>(
      (static_cast<uint16_t>(r) * 77 + static_cast<uint16_t>(g) * 150 +
       static_cast<uint16_t>(b) * 29) >>
      8);
}

uint8_t saturateChannel(uint8_t value, uint8_t luma, uint16_t saturation) {
  const int16_t delta = static_cast<int16_t>(value) - luma;
  const int16_t saturated =
      static_cast<int16_t>(luma) + ((delta * saturation) / 128);
  return static_cast<uint8_t>(constrain(saturated, 0, 255));
}

uint8_t gainChannel(uint8_t value, uint16_t gain) {
  return static_cast<uint8_t>(
      constrain((static_cast<uint16_t>(value) * gain + 64) / 128, 0, 255));
}

CRGB applyTftForegroundProfile(CRGB color) {
  if (color.r == 0 && color.g == 0 && color.b == 0) {
    return color;
  }

  const uint8_t luma = luma8(color.r, color.g, color.b);
  color.r = saturateChannel(color.r, luma, CYD_TFT_FOREGROUND_SATURATION);
  color.g = saturateChannel(color.g, luma, CYD_TFT_FOREGROUND_SATURATION);
  color.b = saturateChannel(color.b, luma, CYD_TFT_FOREGROUND_SATURATION);

  color.r = gainChannel(color.r, CYD_TFT_FOREGROUND_GAIN);
  color.g = gainChannel(color.g, CYD_TFT_FOREGROUND_GAIN);
  color.b = gainChannel(color.b, CYD_TFT_FOREGROUND_GAIN);
  return color;
}

CRGB applyDisplayProfile(CRGB color, uint8_t brightness,
                         uint16_t saturation = 128,
                         uint8_t blackThreshold = 0) {
  if (color.r == 0 && color.g == 0 && color.b == 0) {
    return CRGB(0, 0, 0);
  }

  if (saturation != 128) {
    const uint8_t luma = luma8(color.r, color.g, color.b);
    color.r = saturateChannel(color.r, luma, saturation);
    color.g = saturateChannel(color.g, luma, saturation);
    color.b = saturateChannel(color.b, luma, saturation);
  }

  color.r = scaleChannelByBrightness(color.r, brightness);
  color.g = scaleChannelByBrightness(color.g, brightness);
  color.b = scaleChannelByBrightness(color.b, brightness);

  if (blackThreshold > 0 &&
      maxChannel(color.r, color.g, color.b) < blackThreshold) {
    return CRGB(0, 0, 0);
  }

