drkpxl/esp32-cyd-aquarium/lib/Matrix/CYD/CydMatrix.cpp
  return color;
}

}  // namespace

CydMatrix::CydMatrix()
    : tft(TFT_eSPI()),
      frameBuffer(nullptr),
      rowBuffer(nullptr),
      previousLogicalPixels(nullptr),
      rowBufferLogicalY(-1),
      rowBufferY0(0),
      rowBufferY1(0),
      rowBufferDirty(true),
      dirtyRowStart(CydMatrixSettings::VIEWPORT_HEIGHT),
      dirtyRowEnd(0),
      backlightPwmAttached(false),
      backlightPercent(100) {
  fontSize = 2;
  rotation = CYD_TFT_ROTATION;
}

void CydMatrix::init() {
  allocatePreviousLogicalPixels();
  allocateFrameBuffer();
  tft.init();
  tft.setRotation(rotation);
  tft.setSwapBytes(CYD_TFT_SWAP_BYTES != 0);
  Serial.printf("CYD TFT rotation=%u\n", rotation);
  Serial.printf("CYD TFT pushImage swapBytes=%s\n",
                tft.getSwapBytes() ? "on" : "off");
  Serial.printf("CYD TFT tone correction=%s strength=%u black_threshold=%u\n",
                CYD_TFT_TONE_CORRECTION ? "on" : "off",
                CYD_TFT_TONE_CURVE_STRENGTH,
                CYD_TFT_TONE_BLACK_THRESHOLD);
  Serial.printf("CYD TFT background profile tone=%u brightness=%u black_threshold=%u\n",
                CYD_TFT_BACKGROUND_TONE_CURVE_STRENGTH,
                CYD_BACKGROUND_BRIGHTNESS, CYD_BACKGROUND_BLACK_THRESHOLD);
  Serial.printf(
      "CYD TFT foreground profile tone=%u gain=%u saturation=%u\n",
      CYD_TFT_FOREGROUND_TONE_CURVE_STRENGTH, CYD_TFT_FOREGROUND_GAIN,
      CYD_TFT_FOREGROUND_SATURATION);
  tft.fillScreen(TFT_BLACK);
  initBacklightPwm();
  setBacklightEnabled(brightness > 0);

  background = new GFX_Layer(
      CydMatrixSettings::LOGICAL_WIDTH, CydMatrixSettings::LOGICAL_HEIGHT,
      [this](int16_t x, int16_t y, uint8_t r, uint8_t g, uint8_t b) {
        drawPixelRGB888(x, y, r, g, b);
      });

  foreground = new GFX_Layer(
      CydMatrixSettings::LOGICAL_WIDTH, CydMatrixSettings::LOGICAL_HEIGHT,
      [this](int16_t x, int16_t y, uint8_t r, uint8_t g, uint8_t b) {
        drawPixelRGB888(x, y, r, g, b);
      });

  gfx_compositor = new GFX_LayerCompositor(
      [this](int16_t x, int16_t y, uint8_t r, uint8_t g, uint8_t b) {
        drawPixelRGB888(x, y, r, g, b);
      });
}

uint16_t CydMatrix::packRgb565ForDisplay(uint8_t r, uint8_t g, uint8_t b,
                                         uint8_t brightnessScale,
                                         uint8_t colorProfile) {
  CRGB color(scaleChannelByBrightness(r, brightnessScale),
             scaleChannelByBrightness(g, brightnessScale),
             scaleChannelByBrightness(b, brightnessScale));

  if (colorProfile == kColorProfileForeground) {
    color = applyTftForegroundProfile(color);
    color.r = applyTftToneCurve(color.r, CYD_TFT_FOREGROUND_TONE_CURVE_STRENGTH,
                                0);
    color.g = applyTftToneCurve(color.g, CYD_TFT_FOREGROUND_TONE_CURVE_STRENGTH,
                                0);
    color.b = applyTftToneCurve(color.b, CYD_TFT_FOREGROUND_TONE_CURVE_STRENGTH,
                                0);
  } else {
    color.r = applyTftToneCurve(color.r, CYD_TFT_BACKGROUND_TONE_CURVE_STRENGTH,
                                CYD_TFT_TONE_BLACK_THRESHOLD);
    color.g = applyTftToneCurve(color.g, CYD_TFT_BACKGROUND_TONE_CURVE_STRENGTH,
                                CYD_TFT_TONE_BLACK_THRESHOLD);
    color.b = applyTftToneCurve(color.b, CYD_TFT_BACKGROUND_TONE_CURVE_STRENGTH,
                                CYD_TFT_TONE_BLACK_THRESHOLD);
  }

#if CYD_TFT_SWAP_RB
  return tft.color565(color.b, color.g, color.r);
#else
  return tft.color565(color.r, color.g, color.b);
#endif
}

uint16_t CydMatrix::toRgb565(uint8_t r, uint8_t g, uint8_t b) {
  return packRgb565ForDisplay(r, g, b, brightness, kColorProfileBackground);
}

void CydMatrix::allocateFrameBuffer() {
#if CYD_FRAMEBUFFER_RENDERER
  frameBuffer = static_cast<uint16_t*>(
      heap_caps_malloc(frameBufferByteCount(), MALLOC_CAP_8BIT));

  if (frameBuffer == nullptr) {
    Serial.printf(
        "CYD framebuffer allocation failed bytes=%lu largest_free=%lu; "
        "fallback=rowBuffer\n",
        static_cast<unsigned long>(frameBufferByteCount()),
        static_cast<unsigned long>(
            heap_caps_get_largest_free_block(MALLOC_CAP_8BIT)));
    allocateRowBuffer();
    return;
  }

  clearFrameBuffer(TFT_BLACK);
#else
  allocateRowBuffer();
#endif
}

void CydMatrix::allocateRowBuffer() {
  rowBuffer =
      static_cast<uint16_t*>(heap_caps_malloc(rowBufferByteCount(), MALLOC_CAP_8BIT));

  if (rowBuffer == nullptr) {
    Serial.printf(
        "CYD row buffer allocation failed bytes=%lu largest_free=%lu; "
        "fallback=directDraw\n",
        static_cast<unsigned long>(rowBufferByteCount()),
        static_cast<unsigned long>(
            heap_caps_get_largest_free_block(MALLOC_CAP_8BIT)));
    return;
  }

  Serial.printf("CYD tile buffer active bytes=%lu logical_rows=%u max_height=%u\n",
                static_cast<unsigned long>(rowBufferByteCount()),
                rowBufferLogicalHeight(),
                maxRowBufferHeight());
}

void CydMatrix::allocatePreviousLogicalPixels() {
  const size_t bytes = static_cast<size_t>(CydMatrixSettings::LOGICAL_WIDTH) *
                       CydMatrixSettings::LOGICAL_HEIGHT * sizeof(uint16_t);
  previousLogicalPixels =
      static_cast<uint16_t*>(heap_caps_malloc(bytes, MALLOC_CAP_8BIT));

  if (previousLogicalPixels == nullptr) {
    Serial.printf(
        "CYD dirty tile allocation failed bytes=%lu largest_free=%lu; "
        "fallback=push_all_tiles\n",
        static_cast<unsigned long>(bytes),
        static_cast<unsigned long>(
            heap_caps_get_largest_free_block(MALLOC_CAP_8BIT)));
    return;
  }

  for (uint32_t i = 0;
       i < static_cast<uint32_t>(CydMatrixSettings::LOGICAL_WIDTH) *
               CydMatrixSettings::LOGICAL_HEIGHT;
       ++i) {
    previousLogicalPixels[i] = 0xFFFF;
  }

  Serial.printf("CYD dirty tile tracker active bytes=%lu\n",
                static_cast<unsigned long>(bytes));
}

void CydMatrix::clearFrameBuffer(uint16_t color) {
  if (frameBuffer == nullptr) {
    if (rowBuffer != nullptr) {
      rowBufferLogicalY = -1;
      rowBufferY0 = 0;
      rowBufferY1 = 0;
      rowBufferDirty = true;
    }
    if (previousLogicalPixels != nullptr) {
      for (uint32_t i = 0;
           i < static_cast<uint32_t>(CydMatrixSettings::LOGICAL_WIDTH) *
                   CydMatrixSettings::LOGICAL_HEIGHT;
           ++i) {
        previousLogicalPixels[i] = 0xFFFF;
      }
    }
    return;
  }

  for (uint32_t i = 0; i < frameBufferPixelCount(); ++i) {
    frameBuffer[i] = color;
  }
  markFrameBufferRowsDirty(0, CydMatrixSettings::VIEWPORT_HEIGHT);
}

void CydMatrix::markFrameBufferRowsDirty(uint16_t rowStart, uint16_t rowEnd) {
  if (frameBuffer == nullptr || rowStart >= rowEnd) {
    return;
  }

