drkpxl/esp32-cyd-aquarium/lib/Matrix/CYD/CydMatrix.cpp
  dirtyRowStart = min(dirtyRowStart, rowStart);
  dirtyRowEnd = max(dirtyRowEnd, rowEnd);
}

void CydMatrix::pushFrameBuffer() {
  flushRowBuffer();

  if (frameBuffer == nullptr || dirtyRowStart >= dirtyRowEnd) {
    return;
  }

  const uint16_t dirtyHeight = dirtyRowEnd - dirtyRowStart;
  uint16_t* dirtyRows =
      frameBuffer +
      static_cast<uint32_t>(dirtyRowStart) * CydMatrixSettings::VIEWPORT_WIDTH;

  tft.pushImage(CydMatrixSettings::VIEWPORT_X,
                CydMatrixSettings::VIEWPORT_Y + dirtyRowStart,
                CydMatrixSettings::VIEWPORT_WIDTH, dirtyHeight, dirtyRows);

  dirtyRowStart = CydMatrixSettings::VIEWPORT_HEIGHT;
  dirtyRowEnd = 0;
}

void CydMatrix::resetRowBuffer(uint16_t logicalY) {
  const uint16_t tileStart =
      (logicalY / rowBufferLogicalHeight()) * rowBufferLogicalHeight();
  const uint16_t tileEndCandidate = tileStart + rowBufferLogicalHeight();
  const uint16_t tileEnd =
      tileEndCandidate < CydMatrixSettings::LOGICAL_HEIGHT
          ? tileEndCandidate
          : CydMatrixSettings::LOGICAL_HEIGHT;

  rowBufferLogicalY = tileStart;
  rowBufferDirty = previousLogicalPixels == nullptr;
  rowBufferY0 = CydMatrixSettings::screenYForLogicalEdge(tileStart);
  rowBufferY1 = CydMatrixSettings::screenYForLogicalEdge(tileEnd);
  if (rowBufferY1 <= rowBufferY0) {
    rowBufferY1 = rowBufferY0 + 1;
  }

  const uint16_t rowHeight = rowBufferY1 - rowBufferY0;
  for (uint32_t i = 0;
       i < static_cast<uint32_t>(CydMatrixSettings::VIEWPORT_WIDTH) * rowHeight;
       ++i) {
    rowBuffer[i] = TFT_BLACK;
  }
}

void CydMatrix::flushRowBuffer() {
  if (rowBuffer == nullptr || rowBufferLogicalY < 0) {
    return;
  }

  if (rowBufferDirty) {
    const uint16_t rowHeight = rowBufferY1 - rowBufferY0;
    tft.pushImage(CydMatrixSettings::VIEWPORT_X, rowBufferY0,
                  CydMatrixSettings::VIEWPORT_WIDTH, rowHeight, rowBuffer);
  }
  rowBufferLogicalY = -1;
}

void CydMatrix::writeRowBufferPixel(uint16_t x, uint16_t y, uint16_t color) {
  if (rowBuffer == nullptr) {
    return;
  }

  if (rowBufferLogicalY < 0 ||
      y < static_cast<uint16_t>(rowBufferLogicalY) ||
      y >= static_cast<uint16_t>(rowBufferLogicalY) + rowBufferLogicalHeight()) {
    flushRowBuffer();
    resetRowBuffer(y);
  }

  if (previousLogicalPixels != nullptr) {
    const uint32_t logicalIndex =
        static_cast<uint32_t>(y) * CydMatrixSettings::LOGICAL_WIDTH + x;
    if (previousLogicalPixels[logicalIndex] != color) {
      previousLogicalPixels[logicalIndex] = color;
      rowBufferDirty = true;
    }
  }

  const uint16_t x0 =
      CydMatrixSettings::screenXForLogicalEdge(x) - CydMatrixSettings::VIEWPORT_X;
  uint16_t x1 =
      CydMatrixSettings::screenXForLogicalEdge(x + 1) - CydMatrixSettings::VIEWPORT_X;
  if (x1 <= x0) {
    x1 = x0 + 1;
  }

  const uint16_t y0 =
      CydMatrixSettings::screenYForLogicalEdge(y) - rowBufferY0;
  uint16_t y1 =
      CydMatrixSettings::screenYForLogicalEdge(y + 1) - rowBufferY0;
  if (y1 <= y0) {
    y1 = y0 + 1;
  }
  const uint16_t cellHeight = y1 - y0;
#if CYD_DOT_RENDERER
  if (color == TFT_BLACK) {
    return;
  }

  const uint16_t width = x1 > x0 ? x1 - x0 : 1;
  const uint16_t height = cellHeight > 0 ? cellHeight : 1;
  if (width == 3 && height == 3) {
    const uint16_t centerX = x0 + 1;
    const uint16_t centerY = y0 + 1;
    uint16_t* centerRow =
        rowBuffer + static_cast<uint32_t>(centerY) *
                        CydMatrixSettings::VIEWPORT_WIDTH;
    uint16_t* upperRow =
        rowBuffer + static_cast<uint32_t>(centerY - 1) *
                        CydMatrixSettings::VIEWPORT_WIDTH;
    uint16_t* lowerRow =
        rowBuffer + static_cast<uint32_t>(centerY + 1) *
                        CydMatrixSettings::VIEWPORT_WIDTH;

    upperRow[centerX] = color;
    centerRow[centerX - 1] = color;
    centerRow[centerX] = color;
    centerRow[centerX + 1] = color;
    lowerRow[centerX] = color;
    return;
  }

  const uint16_t minDimension = width < height ? width : height;
  const float radius = max(0.75f, minDimension * dotRadiusRatio());
  const float radiusSq = radius * radius;
  const float centerX = (static_cast<float>(x0) + x1 - 1) * 0.5f;
  const float centerY = (static_cast<float>(y0) + y1 - 1) * 0.5f;

  for (uint16_t py = y0; py < y1; ++py) {
    uint16_t* row =
        rowBuffer + static_cast<uint32_t>(py) * CydMatrixSettings::VIEWPORT_WIDTH;
    for (uint16_t px = x0; px < x1; ++px) {
      const float dx = static_cast<float>(px) - centerX;
      const float dy = static_cast<float>(py) - centerY;
      if (dx * dx + dy * dy <= radiusSq) {
        row[px] = color;
      }
    }
  }
#else
  for (uint16_t py = y0; py < y1; ++py) {
    uint16_t* row =
        rowBuffer + static_cast<uint32_t>(py) * CydMatrixSettings::VIEWPORT_WIDTH;
    for (uint16_t px = x0; px < x1; ++px) {
      row[px] = color;
    }
  }
#endif
}

void CydMatrix::writeFrameBufferDot(uint16_t x0, uint16_t x1, uint16_t y0,
                                    uint16_t y1, uint16_t color) {
  if (frameBuffer == nullptr) {
    return;
  }

  const uint16_t bufferX0 = x0 - CydMatrixSettings::VIEWPORT_X;
  const uint16_t bufferX1 = x1 - CydMatrixSettings::VIEWPORT_X;
  const uint16_t bufferY0 = y0 - CydMatrixSettings::VIEWPORT_Y;
  const uint16_t bufferY1 = y1 - CydMatrixSettings::VIEWPORT_Y;
  const uint16_t width = bufferX1 > bufferX0 ? bufferX1 - bufferX0 : 1;
  const uint16_t height = bufferY1 > bufferY0 ? bufferY1 - bufferY0 : 1;
  const uint16_t minDimension = width < height ? width : height;
  const float radius = max(0.75f, minDimension * dotRadiusRatio());
  const float radiusSq = radius * radius;
  const float centerX = (static_cast<float>(bufferX0) + bufferX1 - 1) * 0.5f;
  const float centerY = (static_cast<float>(bufferY0) + bufferY1 - 1) * 0.5f;

  for (uint16_t py = bufferY0; py < bufferY1; ++py) {
    uint16_t* row =
        frameBuffer +
        static_cast<uint32_t>(py) * CydMatrixSettings::VIEWPORT_WIDTH;
    for (uint16_t px = bufferX0; px < bufferX1; ++px) {
      const float dx = static_cast<float>(px) - centerX;
      const float dy = static_cast<float>(py) - centerY;
      if (dx * dx + dy * dy <= radiusSq) {
        row[px] = color;
      }
    }
  }

  markFrameBufferRowsDirty(bufferY0, bufferY1);
}

