drkpxl/esp32-cyd-aquarium/lib/Matrix/CYD/CydMatrix.cpp
void CydMatrix::writeScaledLogicalPixel(uint16_t x, uint16_t y,
                                        uint16_t color) {
  if (x >= CydMatrixSettings::LOGICAL_WIDTH ||
      y >= CydMatrixSettings::LOGICAL_HEIGHT) {
    return;
  }

  const uint16_t x0 = CydMatrixSettings::screenXForLogicalEdge(x);
  const uint16_t x1 = CydMatrixSettings::screenXForLogicalEdge(x + 1);
  const uint16_t y0 = CydMatrixSettings::screenYForLogicalEdge(y);
  const uint16_t y1 = CydMatrixSettings::screenYForLogicalEdge(y + 1);
  const uint16_t width = x1 > x0 ? x1 - x0 : 1;
  const uint16_t height = y1 > y0 ? y1 - y0 : 1;

  if (frameBuffer != nullptr) {
#if CYD_DOT_RENDERER
    writeFrameBufferDot(x0, x1, y0, y1, color);
    return;
#else
    const uint16_t bufferX0 = x0 - CydMatrixSettings::VIEWPORT_X;
    const uint16_t bufferX1 = x1 - CydMatrixSettings::VIEWPORT_X;
    const uint16_t bufferY0 = y0 - CydMatrixSettings::VIEWPORT_Y;
    const uint16_t bufferY1 = y1 - CydMatrixSettings::VIEWPORT_Y;

    for (uint16_t py = bufferY0; py < bufferY1; ++py) {
      uint16_t* row =
          frameBuffer + static_cast<uint32_t>(py) * CydMatrixSettings::VIEWPORT_WIDTH;
      for (uint16_t px = bufferX0; px < bufferX1; ++px) {
        row[px] = color;
      }
    }
    markFrameBufferRowsDirty(bufferY0, bufferY1);
    return;
#endif
  }

  if (rowBuffer != nullptr) {
    writeRowBufferPixel(x, y, color);
    return;
  }

  // The dot fallback issues thousands of small circle draw calls and is too
  // slow on ESP32-2432S028R boards without enough contiguous RAM for the
  // framebuffer renderer. Keep the direct path rectangular so the first
  // hardware build remains animated and usable.
  tft.fillRect(x0, y0, width, height, color);
}

void CydMatrix::drawPixelRGB888(uint16_t x, uint16_t y, uint8_t r_data,
                                uint8_t g_data, uint8_t b_data) {
  writeScaledLogicalPixel(x, y, toRgb565(r_data, g_data, b_data));
}

void CydMatrix::drawPixelRGB888Profile(uint16_t x, uint16_t y, uint8_t r_data,
                                       uint8_t g_data, uint8_t b_data,
                                       bool foregroundProfile) {
  writeScaledLogicalPixel(
      x, y,
      packRgb565ForDisplay(r_data, g_data, b_data, brightness,
                           foregroundProfile ? kColorProfileForeground
                                             : kColorProfileBackground));
}

void CydMatrix::setBrightness(uint8_t newBrightness) {
  brightness = newBrightness;
  Serial.printf("CYD color brightness=%u/255\n", brightness);
  setBacklightEnabled(brightness > 0);
}

uint8_t CydMatrix::getBrightness() const {
  return brightness;
}

uint8_t CydMatrix::getXResolution() {
  return CydMatrixSettings::LOGICAL_WIDTH;
}

uint8_t CydMatrix::getYResolution() {
  return CydMatrixSettings::LOGICAL_HEIGHT;
}

void CydMatrix::setRotation(uint8_t newRotation) {
  if (newRotation < 4 && newRotation != rotation) {
    rotation = newRotation;
    tft.setRotation(rotation);
  }
}

void CydMatrix::rotate90() {
  rotation = (rotation + 1) % 4;
  tft.setRotation(rotation);
}

void CydMatrix::clearScreen() {
  clearFrameBuffer(TFT_BLACK);
  tft.fillScreen(TFT_BLACK);
}

void CydMatrix::compositeLayers() {
  if (background == nullptr || foreground == nullptr) {
    return;
  }

  for (uint16_t y = 0; y < CydMatrixSettings::LOGICAL_HEIGHT; ++y) {
    for (uint16_t x = 0; x < CydMatrixSettings::LOGICAL_WIDTH; ++x) {
      const CRGB foregroundPixel = foreground->pixels->data[y][x];
      const bool hasForeground =
          foregroundPixel != foreground->transparency_colour;
      const CRGB source =
          hasForeground ? foregroundPixel : background->pixels->data[y][x];
      const CRGB corrected =
          hasForeground
              ? applyDisplayProfile(source, CYD_FOREGROUND_BRIGHTNESS,
                                    CYD_FOREGROUND_SATURATION, 0)
              : applyDisplayProfile(source, CYD_BACKGROUND_BRIGHTNESS, 128,
                                    CYD_BACKGROUND_BLACK_THRESHOLD);

      writeScaledLogicalPixel(
          x, y,
          packRgb565ForDisplay(corrected.r, corrected.g, corrected.b, 255,
                               hasForeground ? kColorProfileForeground
                                             : kColorProfileBackground));
    }
  }

  foreground->clear();
}

bool CydMatrix::isFrameBufferActive() const {
  return frameBuffer != nullptr;
}

bool CydMatrix::isRowBufferActive() const {
  return rowBuffer != nullptr;
}

void CydMatrix::runStartupSmokeTest() {
  setBacklightEnabled(true);

  const uint16_t fillColors[] = {TFT_RED, TFT_GREEN, TFT_BLUE, TFT_BLACK};
  for (uint16_t color : fillColors) {
    tft.fillScreen(color);
    delay(180);
  }

  tft.fillScreen(TFT_BLACK);

  const uint16_t darkWater = toRgb565(3, 16, 30);
  const uint16_t lightWater = toRgb565(7, 32, 50);
  for (uint16_t y = 0; y < CydMatrixSettings::LOGICAL_HEIGHT; ++y) {
    for (uint16_t x = 0; x < CydMatrixSettings::LOGICAL_WIDTH; ++x) {
      const bool checker = ((x / 4) + (y / 4)) % 2 == 0;
      writeScaledLogicalPixel(x, y, checker ? darkWater : lightWater);
    }
  }
  pushFrameBuffer();

  tft.drawRect(CydMatrixSettings::VIEWPORT_X, CydMatrixSettings::VIEWPORT_Y,
               CydMatrixSettings::VIEWPORT_WIDTH,
               CydMatrixSettings::VIEWPORT_HEIGHT, TFT_WHITE);

  const uint16_t cornerSize = 8;
  tft.fillRect(CydMatrixSettings::VIEWPORT_X, CydMatrixSettings::VIEWPORT_Y,
               cornerSize, cornerSize, TFT_RED);
  tft.fillRect(CydMatrixSettings::VIEWPORT_X + CydMatrixSettings::VIEWPORT_WIDTH -
                   cornerSize,
               CydMatrixSettings::VIEWPORT_Y, cornerSize, cornerSize,
               TFT_GREEN);
  tft.fillRect(CydMatrixSettings::VIEWPORT_X,
               CydMatrixSettings::VIEWPORT_Y +
                   CydMatrixSettings::VIEWPORT_HEIGHT - cornerSize,
               cornerSize, cornerSize, TFT_BLUE);
  tft.fillRect(CydMatrixSettings::VIEWPORT_X + CydMatrixSettings::VIEWPORT_WIDTH -
                   cornerSize,
               CydMatrixSettings::VIEWPORT_Y +
                   CydMatrixSettings::VIEWPORT_HEIGHT - cornerSize,
               cornerSize, cornerSize, TFT_YELLOW);

  delay(1200);
  clearFrameBuffer(TFT_BLACK);
  tft.fillScreen(TFT_BLACK);
}

void CydMatrix::update() {
  pushFrameBuffer();
}

void CydMatrix::initBacklightPwm() {
  if (CydMatrixSettings::TFT_BL_PIN < 0) {
    return;
  }

  pinMode(CydMatrixSettings::TFT_BL_PIN, OUTPUT);
#if CYD_TFT_BACKLIGHT_PWM
#if CYD_LEDC_V3
  backlightPwmAttached =
      ledcAttach(CydMatrixSettings::TFT_BL_PIN, CYD_TFT_BACKLIGHT_PWM_FREQ,
                 CYD_TFT_BACKLIGHT_PWM_RESOLUTION);
#else
  ledcSetup(CYD_TFT_BACKLIGHT_PWM_CHANNEL, CYD_TFT_BACKLIGHT_PWM_FREQ,
            CYD_TFT_BACKLIGHT_PWM_RESOLUTION);
  ledcAttachPin(CydMatrixSettings::TFT_BL_PIN, CYD_TFT_BACKLIGHT_PWM_CHANNEL);
  backlightPwmAttached = true;
#endif
  Serial.printf("CYD TFT backlight pwm=%s pin=%d freq=%lu resolution=%u\n",
                backlightPwmAttached ? "on" : "failed",
                CydMatrixSettings::TFT_BL_PIN,
                static_cast<unsigned long>(CYD_TFT_BACKLIGHT_PWM_FREQ),
                CYD_TFT_BACKLIGHT_PWM_RESOLUTION);
#else
  backlightPwmAttached = false;
  Serial.printf("CYD TFT backlight pwm=off pin=%d\n",
                CydMatrixSettings::TFT_BL_PIN);
#endif
}

void CydMatrix::writeBacklightPercent(uint8_t percent) {
  if (CydMatrixSettings::TFT_BL_PIN < 0) {
    return;
  }

