drkpxl/esp32-cyd-aquarium/lib/Matrix/CYD/CydMatrix.cpp
  percent = constrain(percent, 0, 100);
  if (backlightPwmAttached) {
    const uint32_t dutyMax =
        (1UL << CYD_TFT_BACKLIGHT_PWM_RESOLUTION) - 1UL;
    const uint32_t onDuty =
        (static_cast<uint32_t>(percent) * dutyMax + 50UL) / 100UL;
    const uint32_t outputDuty =
        TFT_BACKLIGHT_ON == HIGH ? onDuty : dutyMax - onDuty;
#if CYD_LEDC_V3
    ledcWrite(CydMatrixSettings::TFT_BL_PIN, outputDuty);
#else
    ledcWrite(CYD_TFT_BACKLIGHT_PWM_CHANNEL, outputDuty);
#endif
    return;
  }

  digitalWrite(CydMatrixSettings::TFT_BL_PIN,
               percent > 0 ? TFT_BACKLIGHT_ON : backlightOffLevel());
}

void CydMatrix::setBacklightEnabled(bool enabled) {
  if (CydMatrixSettings::TFT_BL_PIN < 0) {
    return;
  }

  writeBacklightPercent(enabled ? backlightPercent : 0);
}

void CydMatrix::setBacklightPercent(uint8_t percent) {
  percent = constrain(percent, 0, 100);
  if (backlightPercent == percent) {
    return;
  }

  backlightPercent = percent;
  if (brightness > 0) {
    writeBacklightPercent(backlightPercent);
  }
}

uint8_t CydMatrix::getBacklightPercent() const {
  return backlightPercent;
}

void CydMatrix::setColorDiagnostic(bool invert, bool swap) {
  tft.invertDisplay(invert);
  tft.setSwapBytes(swap);
}

// Draws seven full-width solid color bars (top to bottom: RED, GREEN, BLUE,
// YELLOW, CYAN, MAGENTA, WHITE) straight to the panel so the raw channel
// mapping of this display revision can be read by eye.
void CydMatrix::drawColorTestCard() {
  struct TestBar {
    uint8_t r;
    uint8_t g;
    uint8_t b;
  };
  static const TestBar bars[] = {
      {255, 0, 0},   {0, 255, 0},   {0, 0, 255}, {255, 255, 0},
      {0, 255, 255}, {255, 0, 255}, {255, 255, 255},
  };
  const uint8_t count = sizeof(bars) / sizeof(bars[0]);
  const int16_t w = tft.width();
  const int16_t h = tft.height();
  const int16_t bandHeight = h / count;
  for (uint8_t i = 0; i < count; ++i) {
    const int16_t y = i * bandHeight;
    const int16_t bh = (i == count - 1) ? (h - y) : bandHeight;
    tft.fillRect(0, y, w, bh, tft.color565(bars[i].r, bars[i].g, bars[i].b));
  }
  Serial.println(
      "color test card bars top->bottom: RED GREEN BLUE YELLOW CYAN MAGENTA "
      "WHITE");
}

#endif  // PANEL_CYD_TFT
